backend/controllers/RolController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $tipoOperaciones = Operacion::find()->all();
---
SELECT * FROM `rol_operacion` WHERE `rol_id`=1

    protected function findModel($id)
    {
        if (($model = Rol::findOne($id)) !== null) {
---
SELECT * FROM `rol` WHERE `id`='1'