backend/controllers/SolicitanteController.php

    protected function findModel($id)
    {
        if (($model = Solicitante::findOne($id)) !== null) {
---
SELECT * FROM `solicitante` WHERE `id`='1'