common/models/UserMenus.php

SELECT * FROM `user_menus` WHERE (`padre`=0) AND (`activo`='1')
---
   public static function getTree($id = 0)
   {
      $return = array();

      $menu = static::findAll(['padre' => $id, 'activo' => '1']);