frontend/models/Solicitante.php

SELECT * FROM `sexo`
---
   public static function getListaSexo()
   {
       $opciones = Sexo::find()->asArray()->all();

SELECT * FROM `estado_civil`
---
   public static function getListaEstadoCivil()
   {
       $opciones = EstadoCivil::find()->asArray()->all();